import React from 'react';
import './App.css';
import Character from "./components/character/Character";
import Lorem from "./components/Lorem/lorem";

function App() {
    return (
        <div>
            {/*<Character name ={'Bart'}/> - використовується для того, щоб приймати одну і ту ж
        функцію, але з різною інформацією*/}

            {/*щоб зробити description необхідно зробити теги подвійними і зробити опис всередині*/}
            {/*це*/}
            <Character name ={'Bart'}
                image={'https://upload.wikimedia.org/wikipedia/uk/a/aa/Bart_simpson.png'}
            >
                <i>
                    'Бартолом'ю ДжоДжо «Барт» Сімпсон (англ. Bartholomew JoJo «Bart» Simpson) — один із головних героїв
                    мультиплікаційного серіалу Сімпсони. Барт — найстарша дитина Гомера і Мардж Сімпсон. У нього також є
                    дві молодші сестри — Ліса і Меґґі. Барт є втіленням образу бешкетника та посереднього учня у школі.
                    Разом зі своїм батьком Барт є одним із найвідоміших персонажів у цьому серіалі.</i>
                <Lorem/>
            </Character>
            <Character name={'Homer'}
                image={'https://upload.wikimedia.org/wikipedia/en/0/02/Homer_Simpson_2006.png'}>
                <u>Гомер Джей Сімпсон (англ. Homer Jay Simpson) — один із головних героїв мультсеріалу «Сімпсони». Гомер
                    —
                    грубий і неввічливий батько родини, він має очевидні вади: товстий, лисий і не дуже розумний.
                    Нерідко
                    він поводиться як блазень, абсурдно, егоїстично і нетактовно, але все ж лишається симпатичним.'</u>
                <Lorem/>
            </Character>
            <Character name={'Marge'}
                       image={'https://upload.wikimedia.org/wikipedia/ru/0/0b/Marge_Simpson.png'}>
                Ма́рджори Жакли́н «Мардж» Си́мпсон (в девичестве Бувье́) (англ. Marjorie Jacqueline «Marge» Simpson) —
                постоянный персонаж мультипликационного сериала «Симпсоны», её озвучивает Джулия Кавнер.
                Обычно носит зелёное платье, красные балетки, на шее — ожерелье из искусственного жемчуга и
                ездит на оранжевом универсале. У неё шикарные синие волосы,
                которые она обычно собирает в очень высокую причёску. Глаза цвета ореха (19s6e).
                Основное занятие — домохозяйка, большую часть времени проводит в заботе о доме, детях и Гомере.
                Образ Мардж копирует стереотип провинциальной американской домохозяйки 50-х годов.
                Мардж — единственный член семьи, посещающий церковь добровольно.
                Старается поддерживать нравственность не только своей семьи, но и всего города.
                Отлично готовит, особенно славятся её свиные отбивные и зефир. Любимое блюдо — лапша с маслом.
            </Character>

            {/*    треба використовувати компоненти*/}
            {/*  створюємо папку components*/}
            {/*  в папці components створюємо папку character ( персонаж )*/}


        </div>
    );
}

export default App;
